"""
A simple package to provide readily usable varnamala
Languages supported now:
- Sanskrit
"""

__version__ = "0.0.1"

स्वराः = ['अ', 'आ', 'इ', 'ई', 'उ', 'ऊ', 'ऋ', 'ॠ', 'ए', 'ऐ', 'ओ', 'औ', 'अं', 'अः']
स्वरमात्राः = ['ा', 'ि', 'ी', 'ु', 'ू', 'ृ', 'ॄ', 'े', 'ै', 'ो', 'ौ', 'ं', 'ः']

कु = ['क', 'ख', 'ग', 'घ', 'ङ']
चु = ['च', 'छ', 'ज', 'झ', 'ञ']
टु = ['ट', 'ठ', 'ड', 'ढ', 'ण']
तु = ['त', 'थ', 'द', 'ध', 'न']
पु = ['प', 'फ', 'ब', 'भ', 'म']
अन्तस्थाः = ['य', 'र', 'ल', 'व']
ऊष्माणः = ['श', 'ष', 'स', 'ह']

वर्गीयाः = कु + चु + टु + तु + पु
अवर्गीयाः = अन्तस्थाः + ऊष्माणः

व्यञ्जनानि = वर्गीयाः + अवर्गीयाः
हलन्तः = '्'
दण्डः = "।"
दीर्घदण्डः = "॥" 

संख्याः = "०,१,२,३,४,५,६,७,८,९".split(",")

# TODO: स्थानप्रयत्नविवेकः